
**Terraform Cloud Plan Output**



<details><summary>Show Plan(infra/aws/prod)</summary>

```

[command]/home/runner/work/_temp/6e6c4d90-5751-4a24-be84-8c86ea5a9c27/terraform-bin plan -no-color
2024-05-09T13:26:15.295Z [INFO]  Terraform version: 1.8.1
2024-05-09T13:26:15.295Z [INFO]  Go runtime version: go1.22.1
2024-05-09T13:26:15.295Z [INFO]  CLI args: []string{"/home/runner/work/_temp/6e6c4d90-5751-4a24-be84-8c86ea5a9c27/terraform-bin", "plan", "-no-color"}
2024-05-09T13:26:15.296Z [INFO]  CLI command args: []string{"plan", "-no-color"}
2024-05-09T13:26:15.301Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=6a8d9174-5f96-11fc-71f2-c081a9c6eabe tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials
2024-05-09T13:26:15.879Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=6a8d9174-5f96-11fc-71f2-c081a9c6eabe tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-09T13:26:16.018Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=6a8d9174-5f96-11fc-71f2-c081a9c6eabe tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-09T13:26:16.356Z [INFO]  backend/local: starting Plan operation
2024-05-09T13:26:16.974Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=2a22a14d-6757-b4ce-48dc-b79e6c17be9c tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-09T13:26:17.266Z [INFO]  provider: configuring client automatic mTLS
2024-05-09T13:26:17.358Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-09T13:26:17.358Z
2024-05-09T13:26:18.001Z [INFO]  provider: configuring client automatic mTLS
2024-05-09T13:26:18.092Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-09T13:26:18.092Z
2024-05-09T13:26:18.227Z [INFO]  backend/local: plan calling Plan
2024-05-09T13:26:18.229Z [INFO]  provider: configuring client automatic mTLS
2024-05-09T13:26:18.314Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-09T13:26:18.314Z
2024-05-09T13:26:18.420Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved credentials: tf_aws.credentials_source=EnvConfigCredentials tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=0c268edf-0606-2256-7441-1d46092cfed2 tf_rpc=ConfigureProvider @module=aws.aws-base @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 timestamp=2024-05-09T13:26:18.420Z
2024-05-09T13:26:19.003Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved caller identity from STS: @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider tf_mux_provider="*schema.GRPCProviderServer" tf_req_id=0c268edf-0606-2256-7441-1d46092cfed2 timestamp=2024-05-09T13:26:19.003Z
data.aws_ami.ubuntu: Reading...
2024-05-09T13:26:19.013Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute
2024-05-09T13:26:19.015Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-ec2-sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .ingress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow ingress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(0)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow ingress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("tcp"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(0)})})
      - .egress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow egress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("-1"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(0)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow egress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("-1"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(0)})})
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
data.aws_ami.ubuntu: Read complete after 1s [id=ami-0720c7fcba4b88b36]
2024-05-09T13:26:20.033Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_launch_template.algosolved-lt, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .vpc_security_group_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)})
      - .metadata_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-05-09T13:26:20.040Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_autoscaling_group.algosolved-ec2-asg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .wait_for_capacity_timeout: planned value cty.StringVal("10m") for a non-computed attribute
      - .health_check_grace_period: planned value cty.NumberIntVal(300) for a non-computed attribute
      - .protect_from_scale_in: planned value cty.False for a non-computed attribute
      - .metrics_granularity: planned value cty.StringVal("1Minute") for a non-computed attribute
      - .force_delete: planned value cty.False for a non-computed attribute
      - .ignore_failed_scaling_activities: planned value cty.False for a non-computed attribute
      - .force_delete_warm_pool: planned value cty.False for a non-computed attribute
      - .traffic_source: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .mixed_instances_policy: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-05-09T13:26:20.050Z [INFO]  backend/local: plan operation completed

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.algosolved-ec2-asg will be created
  + resource "aws_autoscaling_group" "algosolved-ec2-asg" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 0
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 0
      + name                             = "algosolved-ec2-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = [
          + "subnet-02a53b7890c322346",
          + "subnet-048b8c0b0d0c912b2",
          + "subnet-05c85f1be65b09802",
          + "subnet-06c7c601881a79996",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Project"
          + propagate_at_launch = true
          + value               = "algosolved"
        }
      + tag {
          + key                 = "Stage"
          + propagate_at_launch = true
          + value               = "prod"
        }
    }

  # aws_ecr_repository.algosolved_repository will be created
  + resource "aws_ecr_repository" "algosolved_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "algosolved-ecr"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
    }

  # aws_launch_template.algosolved-lt will be created
  + resource "aws_launch_template" "algosolved-lt" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "This is ASG for Algosolved EC2 instances."
      + id                     = (known after apply)
      + image_id               = "ami-0720c7fcba4b88b36"
      + instance_type          = "t2.micro"
      + key_name               = "algosolved-ec2-key"
      + latest_version         = (known after apply)
      + name                   = "algosolved-launch-template"
      + name_prefix            = (known after apply)
      + tags                   = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + tags_all               = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + iops        = (known after apply)
              + throughput  = (known after apply)
              + volume_size = 50
              + volume_type = "gp3"
            }
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Project" = "algosolved"
              + "Stage"   = "prod"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Project" = "algosolved"
              + "Stage"   = "prod"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Project" = "algosolved"
              + "Stage"   = "prod"
            }
        }
    }

  # aws_security_group.algosolved-ec2-sg will be created
  + resource "aws_security_group" "algosolved-ec2-sg" {
      + arn                    = (known after apply)
      + description            = "Allow vpc network"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow egress from all"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow ingress from all"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "algosolved-ec2-sgp"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + tags_all               = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + vpc_id                 = "vpc-0f87a26ea18c1b807"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + latest_ami_id = "ami-0720c7fcba4b88b36"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_ami.ubuntu: Reading...%0Adata.aws_ami.ubuntu: Read complete after 1s [id=ami-0720c7fcba4b88b36]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_autoscaling_group.algosolved-ec2-asg will be created%0A  + resource "aws_autoscaling_group" "algosolved-ec2-asg" {%0A      + arn                              = (known after apply)%0A      + availability_zones               = (known after apply)%0A      + default_cooldown                 = (known after apply)%0A      + desired_capacity                 = 0%0A      + force_delete                     = false%0A      + force_delete_warm_pool           = false%0A      + health_check_grace_period        = 300%0A      + health_check_type                = (known after apply)%0A      + id                               = (known after apply)%0A      + ignore_failed_scaling_activities = false%0A      + load_balancers                   = (known after apply)%0A      + max_size                         = 3%0A      + metrics_granularity              = "1Minute"%0A      + min_size                         = 0%0A      + name                             = "algosolved-ec2-asg"%0A      + name_prefix                      = (known after apply)%0A      + predicted_capacity               = (known after apply)%0A      + protect_from_scale_in            = false%0A      + service_linked_role_arn          = (known after apply)%0A      + target_group_arns                = (known after apply)%0A      + vpc_zone_identifier              = [%0A          + "subnet-02a53b7890c322346",%0A          + "subnet-048b8c0b0d0c912b2",%0A          + "subnet-05c85f1be65b09802",%0A          + "subnet-06c7c601881a79996",%0A        ]%0A      + wait_for_capacity_timeout        = "10m"%0A      + warm_pool_size                   = (known after apply)%0A%0A      + launch_template {%0A          + id      = (known after apply)%0A          + name    = (known after apply)%0A          + version = "$Latest"%0A        }%0A%0A      + tag {%0A          + key                 = "Project"%0A          + propagate_at_launch = true%0A          + value               = "algosolved"%0A        }%0A      + tag {%0A          + key                 = "Stage"%0A          + propagate_at_launch = true%0A          + value               = "prod"%0A        }%0A    }%0A%0A  # aws_ecr_repository.algosolved_repository will be created%0A  + resource "aws_ecr_repository" "algosolved_repository" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "algosolved-ecr"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A    }%0A%0A  # aws_launch_template.algosolved-lt will be created%0A  + resource "aws_launch_template" "algosolved-lt" {%0A      + arn                    = (known after apply)%0A      + default_version        = (known after apply)%0A      + description            = "This is ASG for Algosolved EC2 instances."%0A      + id                     = (known after apply)%0A      + image_id               = "ami-0720c7fcba4b88b36"%0A      + instance_type          = "t2.micro"%0A      + key_name               = "algosolved-ec2-key"%0A      + latest_version         = (known after apply)%0A      + name                   = "algosolved-launch-template"%0A      + name_prefix            = (known after apply)%0A      + tags                   = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all               = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + vpc_security_group_ids = (known after apply)%0A%0A      + block_device_mappings {%0A          + device_name = "/dev/xvda"%0A%0A          + ebs {%0A              + iops        = (known after apply)%0A              + throughput  = (known after apply)%0A              + volume_size = 50%0A              + volume_type = "gp3"%0A            }%0A        }%0A%0A      + tag_specifications {%0A          + resource_type = "instance"%0A          + tags          = {%0A              + "Project" = "algosolved"%0A              + "Stage"   = "prod"%0A            }%0A        }%0A      + tag_specifications {%0A          + resource_type = "volume"%0A          + tags          = {%0A              + "Project" = "algosolved"%0A              + "Stage"   = "prod"%0A            }%0A        }%0A      + tag_specifications {%0A          + resource_type = "network-interface"%0A          + tags          = {%0A              + "Project" = "algosolved"%0A              + "Stage"   = "prod"%0A            }%0A        }%0A    }%0A%0A  # aws_security_group.algosolved-ec2-sg will be created%0A  + resource "aws_security_group" "algosolved-ec2-sg" {%0A      + arn                    = (known after apply)%0A      + description            = "Allow vpc network"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "allow egress from all"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "allow ingress from all"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + name                   = "algosolved-ec2-sgp"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all               = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + vpc_id                 = "vpc-0f87a26ea18c1b807"%0A    }%0A%0APlan: 4 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + latest_ami_id = "ami-0720c7fcba4b88b36"%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 2024-05-09T13:26:15.295Z [INFO]  Terraform version: 1.8.1%0A2024-05-09T13:26:15.295Z [INFO]  Go runtime version: go1.22.1%0A2024-05-09T13:26:15.295Z [INFO]  CLI args: []string{"/home/runner/work/_temp/6e6c4d90-5751-4a24-be84-8c86ea5a9c27/terraform-bin", "plan", "-no-color"}%0A2024-05-09T13:26:15.296Z [INFO]  CLI command args: []string{"plan", "-no-color"}%0A2024-05-09T13:26:15.301Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=6a8d9174-5f96-11fc-71f2-c081a9c6eabe tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials%0A2024-05-09T13:26:15.879Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=6a8d9174-5f96-11fc-71f2-c081a9c6eabe tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-09T13:26:16.018Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=6a8d9174-5f96-11fc-71f2-c081a9c6eabe tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-09T13:26:16.356Z [INFO]  backend/local: starting Plan operation%0A2024-05-09T13:26:16.974Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=2a22a14d-6757-b4ce-48dc-b79e6c17be9c tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-09T13:26:17.266Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-09T13:26:17.358Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-09T13:26:17.358Z%0A2024-05-09T13:26:18.001Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-09T13:26:18.092Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-09T13:26:18.092Z%0A2024-05-09T13:26:18.227Z [INFO]  backend/local: plan calling Plan%0A2024-05-09T13:26:18.229Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-09T13:26:18.314Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-09T13:26:18.314Z%0A2024-05-09T13:26:18.420Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved credentials: tf_aws.credentials_source=EnvConfigCredentials tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=0c268edf-0606-2256-7441-1d46092cfed2 tf_rpc=ConfigureProvider @module=aws.aws-base @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 timestamp=2024-05-09T13:26:18.420Z%0A2024-05-09T13:26:19.003Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved caller identity from STS: @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider tf_mux_provider="*schema.GRPCProviderServer" tf_req_id=0c268edf-0606-2256-7441-1d46092cfed2 timestamp=2024-05-09T13:26:19.003Z%0A2024-05-09T13:26:19.013Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute%0A2024-05-09T13:26:19.015Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-ec2-sg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .ingress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow ingress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(0)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow ingress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("tcp"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(0)})})%0A      - .egress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow egress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("-1"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(0)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow egress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("-1"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(0)})})%0A      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute%0A2024-05-09T13:26:20.033Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_launch_template.algosolved-lt, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .vpc_security_group_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)})%0A      - .metadata_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-09T13:26:20.040Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_autoscaling_group.algosolved-ec2-asg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .wait_for_capacity_timeout: planned value cty.StringVal("10m") for a non-computed attribute%0A      - .health_check_grace_period: planned value cty.NumberIntVal(300) for a non-computed attribute%0A      - .protect_from_scale_in: planned value cty.False for a non-computed attribute%0A      - .metrics_granularity: planned value cty.StringVal("1Minute") for a non-computed attribute%0A      - .force_delete: planned value cty.False for a non-computed attribute%0A      - .ignore_failed_scaling_activities: planned value cty.False for a non-computed attribute%0A      - .force_delete_warm_pool: planned value cty.False for a non-computed attribute%0A      - .traffic_source: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .mixed_instances_policy: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-09T13:26:20.050Z [INFO]  backend/local: plan operation completed%0A
::debug::exitcode: 0

```

</details>




**Pusher: @youngjun0627**